# Data Analysis with Pandas Course

## Pre-requisites

In [16]:
# Import the Pandas library
import pandas as pd

## 1. Importing Data

### 1.1 Importing from a CSV file

Reading CSV files with Pandas is a crucial concept in data analysis as it allows us to import data from CSV files, which are commonly used to store large datasets. CSV stands for Comma Separated Values and is a simple file format that is widely supported by consumer, business, and scientific applications.

In [17]:
# Load the dataset
df = pd.read_csv("https://afterwork.ai/ds/e/retail_store_81uml.csv")

# Preview the dataset
df.head()

   TransactionID Product  Quantity  Price  CustomerID CustomerName
0              1   Apple        20    0.5         101     John Doe
1              2  Banana        10    0.3         102   Jane Smith
2              3  Orange        15    0.6         103  Bob Johnson
3              4   Apple        25    0.5         104    Sarah Lee
4              5  Banana        30    0.3         105  Anna Nguyen

### 1.2 Importing from an Excel file

Reading Excel files in Python using Pandas is a crucial skill in data analysis. It allows us to import data from Excel files, which are widely used in many fields.

In [18]:
# Load the dataset
df = pd.read_excel("https://bit.ly/retail_store_ds")

# Preview the dataset
df.head()

   ProductID ProductName  Category  Price  QuantitySold
0          1       Apple   Produce    0.5           100
1          2      Banana   Produce    0.3           150
2          3      Carrot   Produce    0.7            80
3          4   Detergent  Cleaning    5.0            50
4          5        Eggs     Dairy    2.0           120

### Challenges

#### Challenge 1

Using the pandas library in Python, read the CSV file from the URL https://afterwork.ai/ds/ch/retail_store_1jtq.csv and store it in a DataFrame. Then, display the first 5 rows of the DataFrame to ensure that the data has been loaded correctly.

In [19]:
# Write your code here
df1 = pd.read_csv("https://afterwork.ai/ds/ch/retail_store_1jtq.csv")
df1.head()

   ProductID         ProductName     Category  Price  QuantitySold    DateSold
0       1001     Apple iPhone 12  Electronics    799            50  2022-01-01
1       1002  Samsung Galaxy S21  Electronics    699            30  2022-01-02
2       1003  HP Pavilion Laptop  Electronics    599            20  2022-01-03
3       1004          Sony 4K TV  Electronics    999            15  2022-01-04
4       1005  Nike Running Shoes     Clothing    120           100  2022-01-05

## 2. Selecting Data

### 2.1 Column Selection

Column selection in Pandas is a fundamental concept in data analysis that allows us to isolate specific data for further analysis. This is done using Python and the Pandas library. The concept is important because it allows us to focus on specific data within a larger dataset, which can make our analysis more efficient and targeted.

In [20]:
# Load the dataset
df = pd.read_csv('https://afterwork.ai/ds/e/retail_store_baje.csv')

# Preview the dataset
df1.head()

   ProductID         ProductName     Category  Price  QuantitySold    DateSold
0       1001     Apple iPhone 12  Electronics    799            50  2022-01-01
1       1002  Samsung Galaxy S21  Electronics    699            30  2022-01-02
2       1003  HP Pavilion Laptop  Electronics    599            20  2022-01-03
3       1004          Sony 4K TV  Electronics    999            15  2022-01-04
4       1005  Nike Running Shoes     Clothing    120           100  2022-01-05

In [21]:
# Select the 'ProductName' column
product_names = df1[['ProductName']]

# Display the column
product_names.head()

          ProductName
0     Apple iPhone 12
1  Samsung Galaxy S21
2  HP Pavilion Laptop
3          Sony 4K TV
4  Nike Running Shoes

In [22]:
# Select the 'Price' column
prices = df1[['Price']]

# Display the column
prices.head()

   Price
0    799
1    699
2    599
3    999
4    120

### 2.2 Multi-Column Selection

Multi-column selection in Pandas allows us to select and work with multiple columns of data from a DataFrame at once. This is particularly useful when we need to perform operations or analysis on specific subsets of our data.

In [23]:
# Load the dataset
df1 = pd.read_csv('https://afterwork.ai/ds/e/retail_store_srghf.csv')

df1.head()

,ProductID,ProductName,Category,Price,QuantitySold,DateSold
0,1,Apple iPhone 12,Electronics,799,50,2022-01-01
1,2,Samsung Galaxy S21,Electronics,699,45,2022-01-02
2,3,HP Laptop,Electronics,999,30,2022-01-03
3,4,Adidas Running Shoes,Fashion,120,100,2022-01-04
4,5,Nike Basketball Shoes,Fashion,150,80,2022-01-05

In [24]:
# Select multiple columns
selected_columns = df1[['ProductName', 'Category', 'Price']]

# Display the new DataFrame
selected_columns

                    ProductName         Category  Price
0               Apple iPhone 12      Electronics    799
1            Samsung Galaxy S21      Electronics    699
2                     HP Laptop      Electronics    999
3          Adidas Running Shoes          Fashion    120
4         Nike Basketball Shoes          Fashion    150
5                  Levi's Jeans          Fashion     70
6                   Instant Pot  Home Appliances     80
7          Dyson Vacuum Cleaner  Home Appliances    300
8             Philips Air Fryer  Home Appliances    100
9                Apple iPad Pro      Electronics    799
10        Samsung Galaxy Tab S7      Electronics    649
11              Dell XPS Laptop      Electronics   1299
12           Puma Running Shoes          Fashion    110
13  Under Armour Training Shoes          Fashion    130
14           Calvin Klein Jeans          Fashion     85
15             KitchenAid Mixer  Home Appliances    200
16       Bissell Vacuum Cleaner  Home Appliances    250
17              Tefal Air Fryer  Home Appliances    120

### Challenges

#### Challenge 2

Using the dataset from the URL: https://afterwork.ai/ds/ch/retail_store_5onc.csv, select the 'Product Name', 'Category', and 'Price' columns. Then, create a new DataFrame with these columns. Remember to use Pandas to read in the CSV file and select the appropriate columns.

In [25]:
# Write your code here
df2 = pd.read_csv("https://afterwork.ai/ds/ch/retail_store_5onc.csv")
df2.head()

selected_columnsdf2 = df2[['Product Name', 'Category', 'Price']]
selected_columnsdf2

                  Product Name     Category  Price
0              Apple iPhone 12  Electronics    799
1           Samsung Galaxy S21  Electronics    699
2           HP Pavilion Laptop  Electronics    599
3            Apple MacBook Pro  Electronics   1299
4           Sony PlayStation 5  Electronics    499
5           Nike Air Max Shoes      Fashion    149
6      Adidas Ultraboost Shoes      Fashion    179
7             Levi's 501 Jeans      Fashion     69
8         Calvin Klein T-Shirt      Fashion     29
9           Ray-Ban Sunglasses      Fashion    153
10              Apple iPad Pro  Electronics    799
11       Microsoft Surface Pro  Electronics    899
12           Apple AirPods Pro  Electronics    199
13         Samsung Galaxy Buds  Electronics    129
14        Apple Watch Series 6  Electronics    399
15          Fossil Men's Watch      Fashion    199
16  Michael Kors Women's Watch      Fashion    249
17               Coach Handbag      Fashion    299
18        Michael Kors Handbag      Fashion    349
19             Apple iPhone 13  Electronics    999

## 3. Filtering Data

### 3.1 Using query() for filtering

Data filtering using the query() function in Pandas allows us to filter data based on a condition. This function is used to extract data that fulfills a certain condition from a DataFrame. The query() function is important because it provides a more efficient and faster way to filter data compared to traditional methods. It is especially useful when dealing with large datasets.

In [26]:
# Load the dataset
df3 = pd.read_csv('https://afterwork.ai/ds/e/retail_store_bqfht.csv')

# Preview the dataset
df3.head()

   ID Product   Category  Price  Quantity  Sold        Date
0   1   Apple      Fruit   1.50       100    50  2022-01-01
1   2  Banana      Fruit   0.50       200   150  2022-01-02
2   3  Carrot  Vegetable   0.75       150    75  2022-01-03
3   4   Donut     Bakery   1.25        50    25  2022-01-04
4   5     Egg      Dairy   0.10       500   250  2022-01-05

In [27]:
# Filter the dataset using query()
filtered_df3 = df3.query('(Price==1.00) & (Sold==100)')

# Display the filtered records
filtered_df3

    ID   Product   Category  Price  Quantity  Sold        Date
14  15    Orange      Fruit    1.0       200   100  2022-01-15
17  18      Rice      Grain    1.0       200   100  2022-01-18
19  20    Tomato  Vegetable    1.0       200   100  2022-01-20
24  25    Yogurt      Dairy    1.0       200   100  2022-01-25
25  26  Zucchini  Vegetable    1.0       200   100  2022-01-26

### 3.2 Using loc for filtering

The loc attribute in Pandas is a powerful tool that allows us to access and manipulate data in a DataFrame based on labels. It is used for indexing and slicing the data frame, in a way that is more intuitive to users. The loc attribute is important because it provides a flexible and efficient way to filter and manipulate data in a DataFrame.

In [28]:
# Load the dataset
df4 = pd.read_csv('https://afterwork.ai/ds/e/retail_store_yngqw.csv')

# Preview the dataset
df4.head()

   ID                Product     Category  Price  Quantity  Sales        Date
0   1        Apple iPhone 12  Electronics    799        10   7990  2022-01-01
1   2     Samsung Galaxy S21  Electronics    699         8   5592  2022-01-02
2   3              HP Laptop  Electronics   1200         5   6000  2022-01-03
3   4   Adidas Running Shoes      Fashion    100        20   2000  2022-01-04
4   5  Nike Basketball Shoes      Fashion    120        15   1800  2022-01-05

In [29]:
# Filter rows where the 'Price' column is greater than 1000
filtered_df4 = df4.loc[df4['Price'] > 1000]

# Display filtered rows
filtered_df4.head()

    ID            Product     Category  Price  Quantity  Sales        Date
2    3          HP Laptop  Electronics   1200         5   6000  2022-01-03
10  11        Rolex Watch      Fashion   5000         2  10000  2022-01-11
11  12      Prada Handbag      Fashion   1200         3   3600  2022-01-12
12  13  Apple MacBook Pro  Electronics   1300         4   5200  2022-01-13
15  16  Louis Vuitton Bag      Fashion   1500         2   3000  2022-01-16

In [30]:
# Filter 'Product' and 'Price' columns for rows where 'Category' is 'Electronics'
electronics_df4 = df4.loc[df4['Category'] == 'Electronics', ['Product', 'Price']]

# Display electronics_df
electronics_df4.head()

                 Product  Price
0        Apple iPhone 12    799
1     Samsung Galaxy S21    699
2              HP Laptop   1200
6         Apple iPad Pro    999
7  Samsung Galaxy Tab S7    650

In [31]:
# Filter 'Product' and 'Sales' columns for rows where 'Sales' is greater than 5000
high_sales_df4 = df4.loc[df4['Sales'] > 5000, ['Product', 'Sales']]

# Display high_sales_df
high_sales_df4.head()

               Product  Sales
0      Apple iPhone 12   7990
1   Samsung Galaxy S21   5592
2            HP Laptop   6000
6       Apple iPad Pro   6993
10         Rolex Watch  10000

### 3.3 Using iloc for filtering

The iloc function in Pandas is a powerful tool that allows us to filter data based on its integer location. It is a purely integer-location based indexing for selection by position. This is important because it allows us to access and manipulate data in a more precise manner. To use iloc, we first need to understand that it works based on the integer index position of the data. For example, if we want to select the first row of a DataFrame, we would use df.iloc[0]. If we want to select a specific column, we would use df.iloc[:, column_number].

In [32]:
# Load the dataset
df5 = pd.read_csv('https://afterwork.ai/ds/e/retail_store_8x90d.csv')

# Preview the dataset
df5.head()

   ID          Product     Category   Price  Quantity    Sales  Discount
0   1  Office Supplies      Binders   13.44         3    40.32       0.0
1   2       Technology       Phones  109.99         7   769.93       0.2
2   3        Furniture       Chairs  170.98         9  1538.82       0.0
3   4  Office Supplies      Storage   22.89         2    45.78       0.0
4   5       Technology  Accessories   99.99         5   499.95       0.1

In [33]:
# Use iloc to select the first 5 rows
first_five_rows = df5.iloc[0:5]

# Display first_five_rows
first_five_rows

   ID          Product     Category   Price  Quantity    Sales  Discount
0   1  Office Supplies      Binders   13.44         3    40.32       0.0
1   2       Technology       Phones  109.99         7   769.93       0.2
2   3        Furniture       Chairs  170.98         9  1538.82       0.0
3   4  Office Supplies      Storage   22.89         2    45.78       0.0
4   5       Technology  Accessories   99.99         5   499.95       0.1

In [34]:
# Use iloc to select the third column
third_column = df5.iloc[:, [2]]

# Display third_column
third_column

       Category
0       Binders
1        Phones
2        Chairs
3       Storage
4   Accessories
5        Tables
6           Art
7      Machines
8     Bookcases
9    Appliances
10       Phones
11       Chairs
12      Storage
13  Accessories
14       Tables
15          Art
16     Machines
17    Bookcases
18   Appliances
19       Phones

In [35]:
# Use iloc to select a specific cell (row 3, column 2)
specific_cell = df5.iloc[[2], [1]]

# Display specific_cell
specific_cell

     Product
2  Furniture

In [36]:
# Use iloc to select a range of rows and columns (rows 1-3, columns 2-4)
subset = df5.iloc[0:3, 1:4]

# Display subset
subset

           Product Category   Price
0  Office Supplies  Binders   13.44
1       Technology   Phones  109.99
2        Furniture   Chairs  170.98

### Challenge

#### Challenge 2

Using the dataset from the URL: https://afterwork.ai/ds/ch/retail_store_h4lx.csv, filter the data to only include products in the 'Electronics' category that have a price greater than $700. Use the loc attribute in Pandas for this task.

In [37]:
# Write your code here
df6 = pd.read_csv("https://afterwork.ai/ds/ch/retail_store_h4lx.csv")
df6.head()

   ProductID           ProductName     Category  Price  Quantity    Supplier
0          1       Apple iPhone 12  Electronics    799        50  Apple Inc.
1          2    Samsung Galaxy S21  Electronics    699        75     Samsung
2          3    HP Pavilion Laptop  Electronics    599        30          HP
3          4  Adidas Running Shoes     Footwear    120       100      Adidas
4          5          Nike Air Max     Footwear    150        80        Nike

In [38]:
# Write your code here
filtered_df6 = df6.loc[(df6['Category']=='Electronics') & (df6['Price']>700)]
filtered_df6

    ProductID        ProductName     Category  Price  Quantity    Supplier
0           1    Apple iPhone 12  Electronics    799        50  Apple Inc.
7           8     Apple iPad Pro  Electronics    999        40  Apple Inc.
9          10    Dell XPS Laptop  Electronics    999        20        Dell
12         13  Apple MacBook Pro  Electronics   1299        15  Apple Inc.
13         14    Samsung QLED TV  Electronics   1299        10     Samsung

## 4. Aggregating Data

### 4.1 Using Groupby for Data Aggregation

The groupby method in Pandas allows us to group data based on certain criteria and then perform aggregate functions on those groups. For instance, if we have a data set of sales data and we want to know the total sales per region, we would group the data by the 'region' column and then apply the sum function to the 'sales' column. This is a powerful tool for data analysis as it enables us to summarize and understand complex data sets.

In [39]:
# Load the data
df7= pd.read_csv('https://afterwork.ai/ds/e/retail_store_duo4.csv')

# Preview the dataset
df7.head()

   ProductID           ProductName     Category  Price  Sales
0          1       Apple iPhone 12  Electronics    799    500
1          2    Samsung Galaxy S21  Electronics    699    450
2          3             HP Laptop  Electronics    999    300
3          4     Apple MacBook Pro  Electronics   1299    200
4          5  Adidas Running Shoes      Fashion    120    600

In [40]:
# Group by 'Category' and calculate total sales
grouped_df7 = df7.groupby('Category')['Sales'].sum().reset_index()

# Print the result
grouped_df7

      Category  Sales
0  Electronics   2650
1      Fashion   8250

### 4.2 Using a Pivot Table for Data Aggregation

Using pivot table in Pandas allows us to summarize and aggregate data based on one or more columns. It is a powerful tool for data analysis and can provide valuable insights into the relationships between variables.

In [41]:
# Load the data
df8 = pd.read_csv("https://afterwork.ai/ds/e/retail_store_smzh8.csv")

# Preview the dataset
df8.head()

   ID Product     Category  Price  Quantity
0   1   Shirt     Clothing     20        10
1   2   Pants     Clothing     30         5
2   3   Shoes     Footwear     50         3
3   4     Hat  Accessories     10         8
4   5   Watch  Accessories    100         2

In [48]:
# Pivot table to aggregate data based on Category and calculate the sum of Price and Quantity
pivot_table = pd.pivot_table(df8, values=['Price', 'Quantity'], index='Category', aggfunc='sum')
# Display the pivot table
pivot_table

             Price  Quantity
Category
Accessories    175        23
Clothing       150        32
Footwear        50         3

### Challenges

#### Challenge 1

Using the dataset from https://afterwork.ai/ds/ch/retail_store_hkg0.csv, write a Python program that groups the data by 'Category' and calculates the total sales for each category. Use the pandas library to read the CSV file, the .groupby() method to group the data, and the .sum() function to calculate the total sales.

In [ ]:
# Write your code here

## 5. Visualizing Data

In [ ]:
# Import the Matlotlib library to perform data visualization

import matplotlib.pyplot as plt

### 5.1 Bar chart

A bar chart is a type of chart that presents categorical data with rectangular bars. The lengths of the bars are proportional to the values they represent. This type of chart is commonly used to compare and visualize data across different categories.

In [ ]:
# Read the dataset from the URL
df = pd.read_csv("https://afterwork.ai/ds/ch/retail_store_xrku.csv")

# Preview the dataset
df.head()

In [ ]:
# Count the number of occurrences for each category
category_counts = df['Category'].value_counts()

# Preview category_counts
category_counts

In [ ]:
# Create a bar chart using the category counts
plt.bar(category_counts.index, category_counts.values)

# Set the title and labels for the chart
plt.title("Quantity of Each Category in Retail Store")
plt.xlabel("Category")
plt.ylabel("Quantity")

# Rotate the x-axis labels for better readability
plt.xticks(rotation=90)

# Display the chart
plt.show()

### 5.2 Histogram

A histogram is a graphical representation of the distribution of a dataset. It is an estimate of the probability distribution of a continuous variable. In a histogram, the data is divided into a set of bins, and the count of observations that fall into each bin is represented by the height of a bar. Histograms are commonly used to visualize the frequency or density of data in different intervals or ranges.

In [ ]:
# Load the dataset
df = pd.read_csv('https://afterwork.ai/ds/ch/computer_science_52z9.csv')

# Preview the dataset
df.head()

In [ ]:
# Create the histogram
plt.hist(df['NetworkingSkill'], bins=10)

# Add labels and title
plt.title('Networking Skill Histogram')
plt.xlabel('Networking Skill')
plt.ylabel('Frequency')

# Display the plot
plt.show()

### 5.3 Line chart

A line chart is a type of chart that displays data as a series of points connected by straight lines. It is used to visualize trends and patterns over time or across different categories. Line charts are particularly useful for showing the relationship between two variables and how they change over a continuous range.

In [ ]:
# Read the CSV file into a DataFrame
df = pd.read_csv("https://afterwork.ai/ds/e/stock_956yk.csv")

# Preview the dataset
df.head()

In [ ]:
# Convert the 'Date' column to datetime format
df['Date'] = pd.to_datetime(df['Date'])

# Set the 'Date' column as the index
df.set_index('Date', inplace=True)

# Preview the dataset
df.head()

In [ ]:
# Plot the line chart with vertical x-axis
plt.plot(df.index, df['Stock Price'])

# Add labels and title
plt.xlabel('Date')
plt.ylabel('Stock Price')
plt.title('Stock Price Over Time')

# Display the chart
plt.xticks(rotation=45) # Rotate the x-labels
plt.show()

### 5.4 Scatter plot

A scatter plot is a type of graph that shows the relationship between two variables. We can create a scatter plot using Python and Matplotlib by specifying the x-axis and y-axis data points to be plotted. We can also customize the look of our plot with different colors, markers, gridlines, etc. To create a basic scatter plot in Python and Matplotlib we use the plt.scatter() function which takes in two arguments: an array containing x-values and another array containing y-values.

In [ ]:
# Reading data from the provided CSV URL into a Pandas DataFrame
df = pd.read_csv('https://afterwork.ai/ds/e/computer_science_yigom.csv')

# Preview the dataset
df.head()

In [ ]:
# Creating a scatter plot with specified marker size, color, and transparency
plt.scatter(df['Speed'], df['Memory Usage'], c='blue')

# Adding labels to the axes
plt.xlabel('Speed')
plt.ylabel('Memory Usage')

# Setting the title of the plot
plt.title('Programming Language Performance')

# Displaying the plot
plt.show()

### Challenges

#### Challenge 3

In [ ]:
# Write your code here

#### Challenge 4

Create a scatter plot using Python and Matplotlib to visualize the relationship between ProgrammingSkill and MathSkill for the students in the dataset located at https://afterwork.ai/ds/ch/computer_science_ct9a.csv. Remember to use the plt.scatter() function and specify the x-axis and y-axis data points to be plotted.

In [ ]:
# Write your code here